БухЭксп/Catalogs/CW_Суда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Суда</Name>
			<Comment>Суда</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Линия</Name>
					<Comment>Линия</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Линии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Страны</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дедвейт</Name>
					<Comment>Величина, равная сумме масс переменных грузов судна, измеряемая в тоннах, то есть сумма массы полезного груза, перевозимого судном, массы топлива, масла, технической и питьевой воды, массы пассажиров с багажом, экипажа и продовольствия.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВаловаяВместимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяШирина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяВысота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IMO</Name>
					<Comment>Уникальный идентификатор судна</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСудна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыСудов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Осадка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияСтраны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Страны</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Суда/Ext/ManagerModule.bsl
Функция СтранаНаДату(Судно, ДатаСведений) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Судно)
		ИЛИ ТипЗнч(Судно) <> Тип("СправочникСсылка.CW_Суда") Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаСведений) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Судно, "Страна");
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Судно", Судно);
	Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ИсторияСтраныСудов.Период) КАК Период,
	|	ИсторияСтраныСудов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЗначенияСтран
	|ИЗ
	|	Справочник.CW_Суда.ИсторияСтраны КАК ИсторияСтраныСудов
	|ГДЕ
	|	ИсторияСтраныСудов.Ссылка = &Судно
	|	И ИсторияСтраныСудов.Период <= &ДатаСведений
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияСтраныСудов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияСтраныСудов.Страна КАК Страна
	|ИЗ
	|	ЗначенияСтран КАК ЗначенияСтран
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CW_Суда.ИсторияСтраны КАК ИсторияСтраныСудов
	|		ПО ЗначенияСтран.Ссылка = ИсторияСтраныСудов.Ссылка
	|			И ЗначенияСтран.Период = ИсторияСтраныСудов.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Страна;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Судно, "Страна");
	КонецЕсли;
	
КонецФункции

Процедура УстановитьАктуальноеЗначениеИсторииСтраны(Страна, ИсторияСтраны) Экспорт
	
	КоличествоЗаписей = ИсторияСтраны.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ИсторияСтраны.Сортировать("Период");
		АктуальнаяЗаписьИстории = ИсторияСтраны[КоличествоЗаписей - 1];
		АктуальнаяЗаписьИстории.Страна = Страна;
		
	КонецЕсли;
	
КонецПроцедуры
